# Activity 11: Sales Data
## Group and Join Practice

In [1]:
# Just run this cell
from datascience import *
import numpy as np

In this activity you'll be looking at 3 tables that all contain information around fictional data related to salespeople, their clients, and their orders. The following sections will create the tables and explain the data they contain.

## `salesperson`
This table contains information about the different salespersons at a company including:
* the salesperson ID number, as an integer
* the salesperson name, as a string
* the city in which the salesperson works, as a string
* the percent commission they earn on their sales, as a float between 0 and 1

In [2]:
salesperson = Table(['Salesperson ID', 'Salesperson Name', 'Salesperson City', 'Commission']).with_rows([
    [5001, 'James Hoog',  'New York', 0.15],
    [5002, 'Nail Knite',  'Paris',    0.13],
    [5005, 'Amoli Alex',  'London',   0.11],
    [5006, 'Mike Lyon',   'Paris',    0.14],
    [5007, 'Adam Plank',  'Rome',     0.13],
    [5003, 'Layla Ahmad', 'San Jose', 0.12]
])

salesperson

Salesperson ID | Salesperson Name | Salesperson City | Commission
5001           | James Hoog       | New York         | 0.15
5002           | Nail Knite       | Paris            | 0.13
5005           | Amoli Alex       | London           | 0.11
5006           | Mike Lyon        | Paris            | 0.14
5007           | Adam Plank       | Rome             | 0.13
5003           | Layla Ahmad      | San Jose         | 0.12

## `customer`

This table contains information about the customers including:
* the customer ID number, as an integer
* the customer name, as a string
* the city in which the customer lives, as a string
* the customer grade, that indicates the volume of purchases they make, as an integer
* the customer's assigned salesperson indicated by the salesperson ID number, as an integer

In [3]:
customer = Table(['Customer ID', 'Customer Name', 'Customer City', 'Grade', 'Salesperson ID']).with_rows([
    [3002, 'Nick Rimando',   'New York',   100, 5001],
    [3007, 'Brad Davis',     'New York',   200, 5001],
    [3005, 'Graham Zusi',    'California', 200, 5002],
    [3008, 'Jilian Green',   'London',     300, 5002],
    [3004, 'Fabian Johnson', 'Paris',      300, 5006],
    [3009, 'Gina Cameron',   'Berlin',     100, 5003],
    [3003, 'Helen Li',       'Moscow',     200, 5007],
    [3001, 'Corey Jackson',  'London',     200, 5005]
])

customer

Customer ID | Customer Name  | Customer City | Grade | Salesperson ID
3002        | Nick Rimando   | New York      | 100   | 5001
3007        | Brad Davis     | New York      | 200   | 5001
3005        | Graham Zusi    | California    | 200   | 5002
3008        | Jilian Green   | London        | 300   | 5002
3004        | Fabian Johnson | Paris         | 300   | 5006
3009        | Gina Cameron   | Berlin        | 100   | 5003
3003        | Helen Li       | Moscow        | 200   | 5007
3001        | Corey Jackson  | London        | 200   | 5005

## `orders`

This table contains information about recent orders, including:
* the order number, as an integer
* the purchase amount in dollars, as a float
* the date of the order, formatted as yyyy-mm-dd, as a string
* the customer who made the purchase (indicated by their ID number)
* the salesperson who made the sale (indicated by their ID number).

**NOTE**: The `.set_format` method is used so that when the column `'Purchase Amount'` is shown it formats the floats it contains as currency, but remember, the dollar sign and commas are NOT stored in this table, just the float values shown in the cell below.

In [4]:
orders = Table(['Order Number', 'Purchase Amount', 'Order Date', 'Customer ID', 'Salesperson ID']).with_rows([
    [70001, 150.50,   '2019-10-05', 3005, 5002],
    [70009, 270.65,   '2019-09-10', 3001, 5005],
    [70002, 65.26,    '2019-10-05', 3002, 5001],
    [70004, 110.50,   '2019-08-17', 3009, 5003],
    [70007, 948.50,   '2019-09-10', 3005, 5002],
    [70005, 2400.60, '2019-07-27', 3007, 5001],
    [70008, 5760.00, '2019-09-10', 3002, 5001],
    [70010, 1983.43, '2019-10-10', 3004, 5006],
    [70003, 2480.40, '2019-10-10', 3009, 5003],
    [70012, 250.45,   '2019-06-27', 3008, 5002],
    [70011, 75.29,    '2019-08-17', 3003, 5007],
    [70013, 3045.60, '2019-04-25', 3002, 5001]
]).set_format('Purchase Amount', CurrencyFormatter)

orders

Order Number | Purchase Amount | Order Date | Customer ID | Salesperson ID
70001        | $150.50         | 2019-10-05 | 3005        | 5002
70009        | $270.65         | 2019-09-10 | 3001        | 5005
70002        | $65.26          | 2019-10-05 | 3002        | 5001
70004        | $110.50         | 2019-08-17 | 3009        | 5003
70007        | $948.50         | 2019-09-10 | 3005        | 5002
70005        | $2,400.60       | 2019-07-27 | 3007        | 5001
70008        | $5,760.00       | 2019-09-10 | 3002        | 5001
70010        | $1,983.43       | 2019-10-10 | 3004        | 5006
70003        | $2,480.40       | 2019-10-10 | 3009        | 5003
70012        | $250.45         | 2019-06-27 | 3008        | 5002
... (2 rows omitted)

### Question 1: Customer Report

Use the `join` and `select` methods to create a Table that has a row for each unique customer that includes the salesperson they are assigned to and the city that the customer lives in. For example:

|Salesperson Name|Customer Name|Customer City|
|----------------|-------------|----|
|James Hoog|Nick Rimando|New York|
|James Hoog|Brad Davis|New York|
|Nail Knite|Graham Zusi|Paris|
|Nail Knite|Jilian Green|Paris|
|Layla Ahmad|Gina Cameron|San Jose|
|Amoli Alex|Corey Jackson|London|
|Mike Lyon|Fabian Johnson|Paris|
|Adam Plank|Helen Li|Rome|

For many of these questions, a good strategy would be to think about how the `join` operation can create a single table that contains all the information you're looking for (and more!) and then use the `select` method to only keep those columns of interest.

For example, here's the solution to this problem.

In [5]:
# This one was a freebee!
salesperson.join('Salesperson ID', customer, 'Salesperson ID').select('Salesperson Name', 'Customer Name', 'Customer City')

Salesperson Name | Customer Name  | Customer City
James Hoog       | Nick Rimando   | New York
James Hoog       | Brad Davis     | New York
Nail Knite       | Graham Zusi    | California
Nail Knite       | Jilian Green   | London
Layla Ahmad      | Gina Cameron   | Berlin
Amoli Alex       | Corey Jackson  | London
Mike Lyon        | Fabian Johnson | Paris
Adam Plank       | Helen Li       | Moscow

### Question 2: Order Report

Create a report that contains the order number, purchase amount, name of the customer, and the city where the customer lives. Then sort by the order number.

|Order Number|Purchase Amount|Customer Name|Customer City|
|------------|---------------|-------------|----|
|70001|\\$150.50|Graham Zusi|California|
|70002|\\$65.26|Nick Rimando|New York|
|70003|\\$2,480.40|Gina Cameron|Berlin|
|70004|\\$110.50|Gina Cameron|Berlin|
|70005|\\$2,400.60|Brad Davis|New York|
|70007|\\$948.50|Graham Zusi|California|
|70008|\\$5,760.00|Nick Rimando|New York|
|70009|\\$270.65|Corey Jackson|London|
|70010|\\$1,983.43|Fabian Johnson|Paris|
|70011|\\$75.29|Helen Li|Moscow|
|70012|\\$250.45|Jilian Green|London|
|70013|\\$3,045.60|Nick Rimando|New York|

In [6]:
# You fill this in
orders.join(
        'Customer ID', customer, 'Customer ID'
    ).select(
        'Order Number', 'Purchase Amount', 'Customer Name', 'Customer City'
    ).sort('Order Number').show()

### Question 3: High Commission Customers

Create a table that shows which customers are paired with salespeople that earn a commission of 13% or more.

|Salesperson Name|Customer Name|Commission|
|----------------|-------------|----------|
|James Hoog|Nick Rimando|0.15|
|James Hoog|Brad Davis|0.15|
|Nail Knite|Graham Zusi|0.13|
|Nail Knite|Jilian Green|0.13|
|Mike Lyon|Fabian Johnson|0.14|
|Adam Plank|Helen Li|0.13|

In [7]:
# You fill this in
salesperson.join(
        'Salesperson ID', customer, 'Salesperson ID'
    ).where(
        'Commission', are.above(0.12)
    ).select(
        'Salesperson Name','Customer Name','Commission')

Salesperson Name | Customer Name  | Commission
James Hoog       | Nick Rimando   | 0.15
James Hoog       | Brad Davis     | 0.15
Nail Knite       | Graham Zusi    | 0.13
Nail Knite       | Jilian Green   | 0.13
Mike Lyon        | Fabian Johnson | 0.14
Adam Plank       | Helen Li       | 0.13

### Question 4: Remote Salesperson

Create a table of customer and salesperson pairings where they two people live in different cities.

|Customer Name|Customer City|Salesperson Name|Salesperson City|
|-------------|----|----------------|------|
|Graham Zusi|Paris|Nail Knite|California|
|Jilian Green|Paris|Nail Knite|London|
|Gina Cameron|San Jose|Layla Ahmad|Berlin|
|Helen Li|Rome|Adam Plank|Moscow|

**Hint:** Break this into two steps. First, create a table that has all the names of customers, salespeople, and their respective cities. Then, write a second line of code that determines when corresponding cities are not equal to each other.

In [8]:
# You fill this in
names_and_cities = salesperson.join(
        'Salesperson ID', customer, 'Salesperson ID'
    ).select(
        'Customer Name', 'Customer City', 'Salesperson Name', 'Salesperson City'
)

names_and_cities.where(names_and_cities.column('Customer City') != names_and_cities.column('Salesperson City'))

Customer Name | Customer City | Salesperson Name | Salesperson City
Graham Zusi   | California    | Nail Knite       | Paris
Jilian Green  | London        | Nail Knite       | Paris
Gina Cameron  | Berlin        | Layla Ahmad      | San Jose
Helen Li      | Moscow        | Adam Plank       | Rome

### Question 5: Full Sales Report

Construct a report that shows every piece of information on a sale, sorted by the purchase amount of the order. Save this table to the name `full_report`, as you'll use it in the next question.

|Salesperson ID|Customer ID|Order Number|Purchase Amount|Order Date|Customer Name|Customer City|Grade|Salesperson Name|Salesperson City|Commission|
|---           |---        |---         |---            |---       |---          |---          |---  |---             |---             |---|
|5001|3002|70002|\\$65.26|2019-10-05|Nick Rimando|New York|100|James Hoog|New York|0.15|
|5007|3003|70011|\\$75.29|2019-08-17|Helen Li|Moscow|200|Adam Plank|Rome|0.13|
|5003|3009|70004|\\$110.50|2019-08-17|Gina Cameron|Berlin|100|Layla Ahmad|San Jose|0.12|
|5002|3005|70001|\\$150.50|2019-10-05|Graham Zusi|California|200|Nail Knite|Paris|0.13|
|5002|3008|70012|\\$250.45|2019-06-27|Jilian Green|London|300|Nail Knite|Paris|0.13|
|5005|3001|70009|\\$270.65|2019-09-10|Corey Jackson|London|200|Amoli Alex|London|0.11
|5002|3005|70007|\\$948.50|2019-09-10|Graham Zusi|California|200|Nail Knite|Paris|0.13|
|5006|3004|70010|\\$1,983.43|2019-10-10|Fabian Johnson|Paris|300|Mike Lyon|Paris|0.14|
|5001|3007|70005|\\$2,400.60|2019-07-27|Brad Davis|New York|200|James Hoog|New York|0.15|
|5003|3009|70003|\\$2,480.40|2019-10-10|Gina Cameron|Berlin|100|Layla Ahmad|San Jose|0.12|
|5001|3002|70013|\\$3,045.60|2019-04-25|Nick Rimando|New York|100|James Hoog|New York|0.15|
|5001|3002|70008|\\$5,760.00|2019-09-10|Nick Rimando|New York|100|James Hoog|New York|0.15|

In [9]:
# You fill this in
full_report = orders.join(
        'Customer ID', customer, 'Customer ID'
    ).join(
        'Salesperson ID', salesperson, 'Salesperson ID'
    ).drop(
        'Salesperson ID_2'
    ).sort('Purchase Amount')
full_report

Salesperson ID | Customer ID | Order Number | Purchase Amount | Order Date | Customer Name  | Customer City | Grade | Salesperson Name | Salesperson City | Commission
5001           | 3002        | 70002        | $65.26          | 2019-10-05 | Nick Rimando   | New York      | 100   | James Hoog       | New York         | 0.15
5007           | 3003        | 70011        | $75.29          | 2019-08-17 | Helen Li       | Moscow        | 200   | Adam Plank       | Rome             | 0.13
5003           | 3009        | 70004        | $110.50         | 2019-08-17 | Gina Cameron   | Berlin        | 100   | Layla Ahmad      | San Jose         | 0.12
5002           | 3005        | 70001        | $150.50         | 2019-10-05 | Graham Zusi    | California    | 200   | Nail Knite       | Paris            | 0.13
5002           | 3008        | 70012        | $250.45         | 2019-06-27 | Jilian Green   | London        | 300   | Nail Knite       | Paris            | 0.13
5005           | 3001        | 70009        | $270.65         | 2019-09-10 | Corey Jackson  | London        | 200   | Amoli Alex       | London           | 0.11
5002           | 3005        | 70007        | $948.50         | 2019-09-10 | Graham Zusi    | California    | 200   | Nail Knite       | Paris            | 0.13
5006           | 3004        | 70010        | $1,983.43       | 2019-10-10 | Fabian Johnson | Paris         | 300   | Mike Lyon        | Paris            | 0.14
5001           | 3007        | 70005        | $2,400.60       | 2019-07-27 | Brad Davis     | New York      | 200   | James Hoog       | New York         | 0.15
5003           | 3009        | 70003        | $2,480.40       | 2019-10-10 | Gina Cameron   | Berlin        | 100   | Layla Ahmad      | San Jose         | 0.12
... (2 rows omitted)

### Question 6: Commissions per Sale

Add a column that contains the commission earned on each sale. It should be the product of the purchase amount and the commission percentage. Then, use the `.set_format` method to make sure this new column is formatted as Currency (see the `orders` table at the start of this activity to see how to use this method).

Save this table to the name `commissions`, you'll use it in the next question.

|Salesperson ID|Customer ID|Order Number|Purchase Amount|Order Date|Customer Name|Customer City|Grade|Salesperson Name|Salesperson City|Commission|Commission Earned|
|--------------|-----------|------------|---------------|----------|-------------|-------------|-----|----------------|----------------|----------|-----------------|
|5001|3002|70002|\$65.26|2019-10-05|Nick Rimando|New York|100|James Hoog|New York|0.15|\$9.79|
|5007|3003|70011|\$75.29|2019-08-17|Helen Li|Moscow|200|Adam Plank|Rome|0.13|\$9.79|
|5003|3009|70004|\$110.50|2019-08-17|Gina Cameron|Berlin|100|Layla Ahmad|San Jose|0.12|\$13.26|
|5002|3005|70001|\$150.50|2019-10-05|Graham Zusi|California|200|Nail Knite|Paris|0.13|\$19.57|
|5002|3008|70012|\$250.45|2019-06-27|Jilian Green|London|300|Nail Knite|Paris|0.13|\$32.56|
|5005|3001|70009|\$270.65|2019-09-10|Corey Jackson|London|200|Amoli Alex|London|0.11|\$29.77|
|5002|3005|70007|\$948.50|2019-09-10|Graham Zusi|California|200|Nail Knite|Paris|0.13|\$123.31|
|5006|3004|70010|\$1,983.43|2019-10-10|Fabian Johnson|Paris|300|Mike Lyon|Paris|0.14|\$277.68|
|5001|3007|70005|\$2,400.60|2019-07-27|Brad Davis|New York|200|James Hoog|New York|0.15|\$360.09|
|5003|3009|70003|\$2,480.40|2019-10-10|Gina Cameron|Berlin|100|Layla Ahmad|San Jose|0.12|\$297.65|
|5001|3002|70013|\$3,045.60|2019-04-25|Nick Rimando|New York|100|James Hoog|New York|0.15|\$456.84|
|5001|3002|70008|\$5,760.00|2019-09-10|Nick Rimando|New York|100|James Hoog|New York|0.15|\$864.00|

In [10]:
# You fill this in
commissions = full_report.with_column(
        'Commission Earned', full_report.column('Purchase Amount') * full_report.column('Commission')
    ).set_format(
        'Commission Earned', CurrencyFormatter)

### Question 7: Top Earner!

Use the `group` method to make the table below:

|Salesperson Name|Commission Earned sum|
|----------------|---------------------|
|James Hoog|\$1,690.72|
|Layla Ahmad|\$310.91|
|Mike Lyon|\$277.68|
|Nail Knite|\$175.43|
|Amoli Alex|\$29.77|
|Adam Plank|\$9.79|

In [11]:
# You fill this in
commissions.select(
    'Salesperson Name', 'Commission Earned'
).group(
    'Salesperson Name', sum
).set_format(
    1, CurrencyFormatter
).sort(
    1, descending=True)

Salesperson Name | Commission Earned sum
James Hoog       | $1,690.72
Layla Ahmad      | $310.91
Mike Lyon        | $277.68
Nail Knite       | $175.43
Amoli Alex       | $29.77
Adam Plank       | $9.79